PedroFnseca/esp32-http-client/tests/test_rest_request.cpp
  int successCode = 0;
  int errCode = 0;
  int respCode = 0;
  std::string errMsg;

  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{\"id\":123}");
  int id = 0;

  client.get("/success")
      .onSuccess([&](int code) { successCode = code; })
      .onError([&](int code, const char* msg) { errCode = code; errMsg = msg; })
      .onResponse([&](int code) { respCode = code; })
      .getBody("id", &id);

  expectEqInt(successCode, 200, "onSuccess called on 200");
  expectEqInt(respCode, 200, "onResponse called on 200");
  expectEqInt(errCode, 0, "onError not called on 200");
  expectEqInt(id, 123, "body parsed on 200");

  successCode = 0;
  errCode = 0;
  respCode = 0;
  errMsg.clear();

  HttpClientStub::reset();
  HttpClientStub::setResponse(500, "{\"error\":\"fail\"}");

  client.get("/error")
      .onSuccess([&](int code) { successCode = code; })
      .onError([&](int code, const char* msg) { errCode = code; errMsg = msg; })
      .onResponse([&](int code) { respCode = code; })
      .getBody("id", &id);

  expectEqInt(successCode, 0, "onSuccess not called on 500");
  expectEqInt(respCode, 500, "onResponse called on 500");
  expectEqInt(errCode, 500, "onError called on 500");
  expectEq(errMsg, "Internal Server Error", "onError received correct message on 500");

  int clientSuccess = 0;
  int clientError = 0;
  int clientResponse = 0;
  client.onSuccess([&](int code) { clientSuccess = code; });
  client.onError([&](int code, const char*) { clientError = code; });
  client.onResponse([&](int code) { clientResponse = code; });

  HttpClientStub::reset();
  HttpClientStub::setResponse(200, "{\"id\":456}");
  client.get("/client-level").getBody("id", &id);

  expectEqInt(clientSuccess, 200, "client onSuccess triggered");
  expectEqInt(clientResponse, 200, "client onResponse triggered");
  expectEqInt(clientError, 0, "client onError not triggered on 200");
}
}  // namespace

int main() {
  runSuite("AddParamFormatting", testAddParamFormatting);
  runSuite("ExecuteBuildsUrlAndPayload", testExecuteBuildsUrlAndPayload);
  runSuite("MethodAliases", testMethodAliases);
  runSuite("ParseResponseBindsTypes", testParseResponseBindsTypes);
  runSuite("ParseNestedJSON", testParseNestedJSON);
  runSuite("ParseNestedJSONMissingFields", testParseNestedJSONMissingFields);
  runSuite("ParseRawArrayJSON", testParseRawArrayJSON);
  runSuite("UnixTimestampFetch", testUnixTimestampFetch);
  runSuite("ClientConfiguration", testClientConfiguration);
  runSuite("AllHttpMethods", testAllHttpMethods);
  runSuite("AutoRetry", testAutoRetry);
  runSuite("ChunkedTransferEncoding", testChunkedTransferEncoding);
  runSuite("LargePayloadRefill", testLargePayloadRefill);
  runSuite("MoreParseEdgeCases", testMoreParseEdgeCases);
  runSuite("ParseEmptyObjectOrArray", testParseEmptyObjectOrArray);
  runSuite("AddParamAdvanced", testAddParamAdvanced);
  runSuite("ExecuteCustomPortWithPath", testExecuteCustomPortWithPath);
  runSuite("ParseEscapedStringsSimple", testParseEscapedStringsSimple);
  runSuite("SkipValueAdvanced", testSkipValueAdvanced);
  runSuite("MoveConstructor", testMoveConstructor);
  runSuite("ParsePrimitiveTypes", testParsePrimitiveTypes);
  runSuite("AuthBearer", testAuthBearer);
  runSuite("AuthBasic", testAuthBasic);
  runSuite("AuthApiKey", testAuthApiKey);
  runSuite("AuthEdgeCases", testAuthEdgeCases);
  runSuite("QueryParameters", testQueryParameters);
  runSuite("PathParameters", testPathParameters);
  runSuite("PathAndQueryCombined", testPathAndQueryCombined);
  runSuite("PathEdgeCases", testPathEdgeCases);
  runSuite("RuntimeUrlChange", testRuntimeUrlChange);
  runSuite("Timeout", testTimeout);
  runSuite("MaxRetry", testMaxRetry);
  runSuite("ErrorHandlingAndMessages", testErrorHandlingAndMessages);
  runSuite("Callbacks", testCallbacks);

  const int suitesFailed = suitesRun - suitesPassed;
  const double suitePassRate = suitesRun > 0 ? (100.0 * static_cast<double>(suitesPassed) / static_cast<double>(suitesRun)) : 0.0;
  const double checkPassRate = checks > 0 ? (100.0 * static_cast<double>(passedChecks) / static_cast<double>(checks)) : 0.0;

  std::cout << "\n=== Test Summary ===\n";
  std::cout << "Suites: " << suitesRun << " total | " << suitesPassed << " passed | " << suitesFailed << " failed\n";
  std::cout << "Checks: " << checks << " total | " << passedChecks << " passed | " << failures << " failed\n";
  std::cout << std::fixed << std::setprecision(1);
  std::cout << "Pass rate: " << suitePassRate << "% suites | " << checkPassRate << "% checks\n";

  if (failures == 0) {
    std::cout << "All unit tests passed.\n";
    return 0;
  }

  std::cerr << failures << " test(s) failed.\n";
  return 1;
}
